print("Aod AI 1.0")
import os
while True:
    user = input("Вы: ").lower()
    if user == "привет":
        print("Привет! Я Aod AI! Созданный разработчиком AODER")
    elif user == "":
        print("Напиши что нибудь! Может помочь с математикой?")
    elif user == "математика":
        print("Перейти в режим математики?")
        print("Y/N")
        ans = input("Y/N Ai>").lower()
        if ans == "y":
            print("Введите действие *, :, +, -")
            do = input(">")
            if do == "*":
                print("Введи первое число!")
                a = input("FirstNumb>")
                print("Введи второе число!")
                b = input("SecondNumb>")
                c = int(a) * int(b)
                print("Ответ: " + str(c))
            elif do == ":":
                print("Введи первое число!")
                a = input("FirstNumb>")
                print("Введи второе число!")
                b = input("SecondNumb>")
                if int(b) <= 0:
                    print("На ноль не делят!")
                else:
                    c = int(a) / int(b)
                print("Ответ: " + str(c))
            elif do == "+":
                print("Введи первое число!")
                a = input("FirstNumb>")
                print("Введи второе число!")
                b = input("SecondNumb>")
                c = int(a) + int(b)
                print("Ответ: " + str(c))
            elif do == "-":
                print("Введи первое число!")
                a = input("FirstNumb>")
                print("Введи второе число!")
                b = input("SecondNumb>")
                c = int(a) - int(b)
                print("Ответ: " + str(c))
            else:
                print("Не понимаю о чем ты говоришь!")
        else:
            print("Отменено!")
    elif user == "кто ты":
        print("Я Aod AI Искуственный интелект созданный Aoder. Может тебе чем то помочь?")
    elif user == "имеешь ли ты вкусы":
        print("Если бы я мог видеть то конечно!")
    elif user == "что ты умеешь":
        print("Я умею: ")
        print("1.Считать")
        print("2.Отвечать на вопросы")
    elif user == "выход":
        os.system("clear")
        break
    elif user == "умеешь ли ты писать код":
        print("Нет я могу дать только готовый код! Но я могу помочь с чем то другим!")
    elif user == "шутка":
        print("Слон наступил на колобка и сказал блин!")
        print("Почему люди в африке темные? Грязь надо водой смывать!")
        print("Для чего создали головоломку? Что бы ломать голову!")
    elif user == "почему идет дождь":
        print("""Давай разберем коротко и понятно!
        Пошел дождь люди думают. (Почему дождь постоянно идет?)
        Дождь идет из тучи. Туча - из воды, Вода - из дождя,
        Вопрос! Как же получается туча? С помощью солнца!
        Солнце согревает воду до пара, пар превращается в облако, облако в тучу!""")
    elif user == "как собрать кубик рубик":
        print("""Если вы только хотите выучить куберство вам надо знать:
        Пиф-паф=R, U, R', U'
        Формулы=R, L, B, F, U, D
        Для начала разберем формулы
        R = Повернуть правую грань по часовой стрелки
        L = Повернуть левую грань по часовой стрелки
        B = Повернуть протвоположную от тебя грань по часовой стрелки
        F = Повернуть на тебя смотрящую грань по часовой стрелки
        U = Повернуть верхнюю грань по часовой стрелки
        D = Повернуть нижнию грань по часовой стрелк
        ' = Повернуть против часовой стрелки
        2 = Повернуть 2 раза по часовой стрелке
        Для начала надо собрать Ромашку. Поверните все белые грани к желтому центру.
        Как только вы повернули сразу смотрите на 2-й цвет белой грани и поверните
        её к центру этого цвета. Как только вы повернули все грани вы собрали "Белый крест".
        Теперь вам надо собрать белую сторону. Найдите все белые углы и их 3 цветов например "Белый, Красный, Синий"
        Затем поверните ближе к этим цветам (кроме белого) они могут не совпадать по цветам.
        Сейчас вы должны делать пиф паф до того пока не ставите в нужный угол. Как только вы собрали
        белую сторону вам надо собрать средний слой. Это легче чем вы думаете.
        Держите кубик белой стороной вниз и делайте следуйщие действия. Для начала убедитесь что
        деталь которую вы хотите поставить в средний слой не имеет желтого цвета.
        Ой токены на соо закончились!
        Ну может потом повезет!
        """)
    else:
        print("Не понимаю о чем ты говоришь!")